<a href="https://colab.research.google.com/github/AnthonyJFeola/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [4]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-01-24 00:22:47--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.130.13
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.130.13|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  34.9MB/s    in 6.2s

2020-01-24 00:22:54 (31.8 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [5]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [6]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [7]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
# Import libraries.
import numpy as np
import pandas as pd

In [9]:
# Inspect aisles.csv.
aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [10]:
# Inspect departments.csv.
departments = pd.read_csv('departments.csv')
print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [11]:
# Inspect order_products__prior.csv.
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [12]:
# Inspect order_products__train.csv.
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [13]:
# Inspect orders.csv.
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [14]:
# Inspect products.csv.
products = pd.read_csv('products.csv')
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [15]:
# I will only require order_products__prior.csv, order_products__train.csv, and 
# products.csv. First, I will concatenate order_products__prior and 
# order_products__train.
order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [16]:
# Drop unnecessary columns.
order_products = order_products.drop(columns=['add_to_cart_order', 'reordered'])
# Verify changes.
order_products.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [17]:
# Drop unnecessary columns from products prior to merge.
products = products.drop(columns=['aisle_id', 'department_id'])
products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [18]:
# Merge order_products and products.
order_products_merge_products = pd.merge(order_products, products)
order_products_merge_products.head()

   order_id  product_id        product_name
0         2       33120  Organic Egg Whites
1        26       33120  Organic Egg Whites
2       120       33120  Organic Egg Whites
3       327       33120  Organic Egg Whites
4       390       33120  Organic Egg Whites

In [19]:
# Assign top ten products to a list.
top_ten_products = order_products_merge_products['product_name'].value_counts(ascending=False).index[:10].tolist()
top_ten_products

['Banana',
 'Bag of Organic Bananas',
 'Organic Strawberries',
 'Organic Baby Spinach',
 'Organic Hass Avocado',
 'Organic Avocado',
 'Large Lemon',
 'Strawberries',
 'Limes',
 'Organic Whole Milk']

In [20]:
# Create a condition for the top ten products in order_products_merge_products.
condition = (order_products_merge_products['product_name'].isin(top_ten_products))
condition

0           False
1           False
2           False
3           False
4           False
            ...
33819101    False
33819102    False
33819103    False
33819104    False
33819105    False
Name: product_name, Length: 33819106, dtype: bool

In [21]:
# Pass the condition to order_products_merge_products and assign to final while
# dropping 'order_id' column
final = order_products_merge_products[condition].drop(columns='order_id')
# Verify changes.
final.head()

        product_id          product_name
262494       21903  Organic Baby Spinach
262495       21903  Organic Baby Spinach
262496       21903  Organic Baby Spinach
262497       21903  Organic Baby Spinach
262498       21903  Organic Baby Spinach

In [23]:
# Display the top ten products and the quantity of times ordered for each product.
final['product_name'].value_counts()[:10]

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [24]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [25]:
# table2 -> tidy
temp_table = table2.reset_index()
tidy = temp_table.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [26]:
# Rename columns.
tidy = tidy.rename(columns={
    'index': 'Treatment', 
    'variable': 'Name', 
    'value': 'Result'

})
tidy

    Treatment          Name  Result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [27]:
# tidy -> table2
wide = tidy.pivot_table(index='Name', columns='Treatment', values='Result')
# View changes.
wide

Treatment     treatmenta  treatmentb
Name
Jane Doe            16.0        11.0
John Smith           NaN         2.0
Mary Johnson         3.0         1.0

In [0]:
# Import seaborn library.
import seaborn as sns

In [29]:
# Load flights dataset.
flights = sns.load_dataset('flights')
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [30]:
# Configure flights pivot table.
flights_piv = flights.pivot_table(index='year', columns='month', values='passengers')
# View changes.
flights_piv

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
latest_user_order = pd.read_csv('order_products__train.csv')

In [0]:
latest_user_order = latest_user_order.drop(columns=['add_to_cart_order', 'reordered'])

In [33]:
latest_user_order.head()

   order_id  product_id
0         1       49302
1         1       11109
2         1       10246
3         1       49683
4         1       43633

In [0]:
all_orders = pd.read_csv('orders.csv')

In [35]:
all_orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [0]:
latest_order_info = pd.merge(latest_user_order, all_orders)

In [37]:
latest_order_info.head()

   order_id  product_id  ...  order_hour_of_day days_since_prior_order
0         1       49302  ...                 10                    9.0
1         1       11109  ...                 10                    9.0
2         1       10246  ...                 10                    9.0
3         1       49683  ...                 10                    9.0
4         1       43633  ...                 10                    9.0

[5 rows x 8 columns]

In [0]:
product_info = pd.read_csv('products.csv')

In [39]:
product_info.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [0]:
product_info = product_info.drop(columns=['aisle_id', 'department_id'])

In [41]:
product_info.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [0]:
latest_order_with_product_info = pd.merge(latest_order_info, product_info)

In [43]:
latest_order_with_product_info.head()

   order_id  product_id  ...  days_since_prior_order      product_name
0         1       49302  ...                     9.0  Bulgarian Yogurt
1    816049       49302  ...                    16.0  Bulgarian Yogurt
2   1242203       49302  ...                     7.0  Bulgarian Yogurt
3   1383349       49302  ...                    14.0  Bulgarian Yogurt
4   1787378       49302  ...                    30.0  Bulgarian Yogurt

[5 rows x 9 columns]

In [0]:
latest_order_with_product_info = latest_order_with_product_info.drop(columns=['order_id', 'product_id', 'user_id', 'eval_set', 'order_number', 'days_since_prior_order'])

In [45]:
latest_order_with_product_info.head()

   order_dow  order_hour_of_day      product_name
0          4                 10  Bulgarian Yogurt
1          4                  6  Bulgarian Yogurt
2          0                  7  Bulgarian Yogurt
3          3                  8  Bulgarian Yogurt
4          4                 14  Bulgarian Yogurt

In [0]:
condition = (latest_order_with_product_info['order_hour_of_day'] == 23) & (latest_order_with_product_info['order_dow'] == 6)

In [0]:
latest_order_with_product_info = latest_order_with_product_info[condition]

In [48]:
latest_order_with_product_info.head()

      order_dow  order_hour_of_day            product_name
744           6                 23   Organic Celery Hearts
816           6                 23   Organic Celery Hearts
1890          6                 23          Cucumber Kirby
3339          6                 23          Cucumber Kirby
3843          6                 23  Bag of Organic Bananas

In [0]:
sunday_pm_latest_train_items = latest_order_with_product_info.drop_duplicates(subset =['product_name'])

In [66]:
sunday_pm_latest_train_items.head(25)

        order_dow  ...                                  product_name
33701           6  ...                            Super Greens Salad
34002           6  ...           Cage Free Extra Large Grade AA Eggs
34032           6  ...                         Prosciutto, Americano
40907           6  ...    Organic Raw Unfiltered Apple Cider Vinegar
44130           6  ...                      Organic Hot House Tomato
47942           6  ...                                Roasted Turkey
69376           6  ...  Whole Milk Greek Blended Vanilla Bean Yogurt
73745           6  ...                         Raspberry Sorbet Pops
90485           6  ...    Organic Stringles Mozzarella String Cheese
90735           6  ...                               Organic Ketchup
96433           6  ...                              Organic Lemonade
97115           6  ...                                 Aluminum Foil
97479           6  ...                                  Plastic Wrap
105873          6  ...                            Premium Epsom Salt
106085          6  ...         Baked Sea Salt & Vinegar Potato Chips
106625          6  ...              XL Emerald White Seedless Grapes
126820          6  ...                        Organic Yellow Peaches
127982          6  ...                      Citrus Mandarins Organic
148499          6  ...                          Vitamin D Whole Milk
153113          6  ...           Uncured Hickory Smoked Sunday Bacon
153877          6  ...                     Organic Medium Brown Eggs
166844          6  ...                                       Almonds
178993          6  ...           Organic Whole Milk with DHA Omega-3
180727          6  ...                                    Baby Wipes
180875          6  ...                                   Basil Pesto

[25 rows x 3 columns]

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####